----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  R:\new_R_drive_structure\users\dcooper\Stata\average_wages_by_state\avg_wage_log79to19.txt
  log type:  text
 opened on:  23 Jan 2020, 13:24:54

. set more off

. numlabel, add
(dataset has no value labels)

. 
. clear

. 
. load_epiextracts, begin(1979m1) end(2019m12) sample(org)
Processing CPS ORG, 1979m1-1979m12: _all
Processing CPS ORG, 1980m1-1980m12: _all
Processing CPS ORG, 1981m1-1981m12: _all
Processing CPS ORG, 1982m1-1982m12: _all
Processing CPS ORG, 1983m1-1983m12: _all
Processing CPS ORG, 1984m1-1984m12: _all
Processing CPS ORG, 1985m1-1985m12: _all
Processing CPS ORG, 1986m1-1986m12: _all
Processing CPS ORG, 1987m1-1987m12: _all
Processing CPS ORG, 1988m1-1988m12: _all
Processing CPS ORG, 1989m1-1989m12: _all
Processing CPS ORG, 1990m1-1990m12: _all
Processing CPS ORG, 1991m1-1991m12: _all
Processing CPS ORG, 1992m1-1992m12: _all
Processing CPS ORG, 1993m1-1993m12: _all
Processing CPS ORG, 1994m1-1994m12: _all
Processing CPS ORG, 1995m1-1995m12: _all
Processing CPS ORG, 1996m1-1996m12: _all
Processing CPS ORG, 1997m1-1997m12: _all
Processing CPS ORG, 1998m1-1998m12: _all
Processing CPS ORG, 1999m1-1999m12: _all
Processing CPS ORG, 2000m1-2000m12: _all
Processing CPS ORG, 2001m1-2001m12: _all
Processing CPS ORG, 2002m1-2002m12: _all
Processing CPS ORG, 2003m1-2003m12: _all
Processing CPS ORG, 2004m1-2004m12: _all
Processing CPS ORG, 2005m1-2005m12: _all
Processing CPS ORG, 2006m1-2006m12: _all
Processing CPS ORG, 2007m1-2007m12: _all
Processing CPS ORG, 2008m1-2008m12: _all
Processing CPS ORG, 2009m1-2009m12: _all
Processing CPS ORG, 2010m1-2010m12: _all
Processing CPS ORG, 2011m1-2011m12: _all
Processing CPS ORG, 2012m1-2012m12: _all
Processing CPS ORG, 2013m1-2013m12: _all
Processing CPS ORG, 2014m1-2014m12: _all
Processing CPS ORG, 2015m1-2015m12: _all
Processing CPS ORG, 2016m1-2016m12: _all
Processing CPS ORG, 2017m1-2017m12: _all
Processing CPS ORG, 2018m1-2018m12: _all
Processing CPS ORG, 2019m1-2019m12: _all

Loading CPS ORG, 1979m1-1979m12
Loading CPS ORG, 1980m1-1980m12
Loading CPS ORG, 1981m1-1981m12
Loading CPS ORG, 1982m1-1982m12
Loading CPS ORG, 1983m1-1983m12
Loading CPS ORG, 1984m1-1984m12
Loading CPS ORG, 1985m1-1985m12
Loading CPS ORG, 1986m1-1986m12
Loading CPS ORG, 1987m1-1987m12
Loading CPS ORG, 1988m1-1988m12
Loading CPS ORG, 1989m1-1989m12
Loading CPS ORG, 1990m1-1990m12
Loading CPS ORG, 1991m1-1991m12
Loading CPS ORG, 1992m1-1992m12
Loading CPS ORG, 1993m1-1993m12
Loading CPS ORG, 1994m1-1994m12
Loading CPS ORG, 1995m1-1995m12
Loading CPS ORG, 1996m1-1996m12
Loading CPS ORG, 1997m1-1997m12
Loading CPS ORG, 1998m1-1998m12
Loading CPS ORG, 1999m1-1999m12
Loading CPS ORG, 2000m1-2000m12
Loading CPS ORG, 2001m1-2001m12
Loading CPS ORG, 2002m1-2002m12
Loading CPS ORG, 2003m1-2003m12
Loading CPS ORG, 2004m1-2004m12
Loading CPS ORG, 2005m1-2005m12
Loading CPS ORG, 2006m1-2006m12
Loading CPS ORG, 2007m1-2007m12
Loading CPS ORG, 2008m1-2008m12
Loading CPS ORG, 2009m1-2009m12
Loading CPS ORG, 2010m1-2010m12
Loading CPS ORG, 2011m1-2011m12
Loading CPS ORG, 2012m1-2012m12
Loading CPS ORG, 2013m1-2013m12
Loading CPS ORG, 2014m1-2014m12
Loading CPS ORG, 2015m1-2015m12
Loading CPS ORG, 2016m1-2016m12
Loading CPS ORG, 2017m1-2017m12
Loading CPS ORG, 2018m1-2018m12
Loading CPS ORG, 2019m1-2019m12

Using EPI CPS ORG Extracts, Version 1.0, located in W:/data/cps/org/epi/

. 
. sort year statecensus

. 
. tempfile orgdata

. save `orgdata'
file C:\Users\dcooper\AppData\Local\Temp\12\ST_00000001.tmp saved

. 
. binipolate wage if wage > 0 & wage ~= . [pw=orgwgt], binsize(0.25) ///
>  percentiles(20 80) by(year statecensus)
Calculating classical percentiles...
Calculating binned percentiles...

.  
.  keep year statecensus p*_binned

.  
.  merge 1:m year statecensus using `orgdata'
(label statecensus already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        13,132,360  (_merge==3)
    -----------------------------------------

. 
.  gen wagerange=.
(13,132,360 missing values generated)

.  replace wagerange=1 if wage<p20_binned
(1,384,886 real changes made)

.  replace wagerange=2 if p20_binned<=wage & wage<=p80_binned
(4,214,539 real changes made)

.  replace wagerange=3 if wage>p80_binned
(7,532,935 real changes made)

.  
.  save `orgdata', replace
file C:\Users\dcooper\AppData\Local\Temp\12\ST_00000001.tmp saved

.  
.  sort year statecensus 

.  collapse (mean) bottom_wage=wage if wagerange==1 [pw=orgwgt], /// 
>         by (year statecensus)

. 
.  tempfile bottom

.  save `bottom'
file C:\Users\dcooper\AppData\Local\Temp\12\ST_00000002.tmp saved

. 
.  clear

.  use `orgdata'

.  
.  collapse (mean) mid_wage=wage if wagerange==2 [pw=orgwgt], /// 
>         by (year statecensus)

. 
.  tempfile middle

.  save `middle'
file C:\Users\dcooper\AppData\Local\Temp\12\ST_00000003.tmp saved

.  
.  clear

.  use `orgdata'

.  
.  collapse (mean) top_wage=wage if wagerange==3 [pw=orgwgt], /// 
>         by (year statecensus)

. 
.  tempfile top

.  save `top'
file C:\Users\dcooper\AppData\Local\Temp\12\ST_00000004.tmp saved

.  
.  merge 1:1 year statecensus using `middle'
(label statecensus already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,091  (_merge==3)
    -----------------------------------------

.  
.  drop _merge

.  
.  merge 1:1 year statecensus using `bottom'
(label statecensus already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             2,091  (_merge==3)
    -----------------------------------------

.  
.  drop _merge

.  
.  export excel using "avgs_17_19_byState79_19.xlsx", firstrow(var) replace
file avgs_17_19_byState79_19.xlsx saved

.  
.  log close
      name:  <unnamed>
       log:  R:\new_R_drive_structure\users\dcooper\Stata\average_wages_by_state\avg_wage_log79to19.txt
  log type:  text
 closed on:  23 Jan 2020, 13:57:14
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
